Repository: JMVS/zipinstaller-modern
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: es

source: Warning
es: Atención

source: pywin32 is not installed. Shortcuts will not work.
es: pywin32 no está instalado. Los accesos directos no funcionarán.

source: pefile is not installed. Executable metadata reading will not work.
es: pefile no está instalado. No se podrán leer metadatos de ejecutables.

source: pyshortcuts is not installed. Will use win32com for shortcuts.
es: pyshortcuts no está instalado. Se usará win32com para accesos directos.

source: Yes
es: Sí

source: Error reading ZIP: {error}
es: Error leyendo ZIP: {error}

source: Error reading executable metadata: {error}
es: Error leyendo metadatos del ejecutable: {error}

source: Error creating shortcut with win32com: {error}
es: Error creando acceso directo con win32com: {error}

source: Error creating shortcut with pyshortcuts: {error}
es: Error creando acceso directo con pyshortcuts: {error}

source: Install with ZIM...
es: Instalar con ZIM...

source: Error registering in {progid}: {error}
es: Error registrando en {progid}: {error}

source: Generic fallback error: {error}
es: Error en fallback universal: {error}

source: Error registering context menu: {error}
es: Error registrando menú contextual: {error}

source: Error unregistering context menu: {error}
es: Error eliminando menú contextual: {error}

source: Extracting files...
es: Extrayendo archivos...

source: Creating uninstaller...
es: Creando desinstalador...

source: Compiling installation info...
es: Creando información de instalación...

source: The executable {exec} does not exist in the ZIP
es: El ejecutable {self.config['executable']} no existe en el ZIP

source: Creating Desktop shortcut...
es: Creando acceso directo en escritorio...

source: Could not create Desktop shortcut: {error}
es: No se pudo crear acceso directo en escritorio: {error}

source: Creating Start Menu shortcut...
es: Creando acceso directo en menú inicio...

source: Could not create Start Menu shortcut: {error}
es: No se pudo crear acceso directo en menú inicio: {error}

source: Registering in system...
es: Registrando en el sistema...

source: Installation complete!
es: ¡Instalación completada!

source: Could not create Registry entry: {error}
es: No se pudo crear la entrada del registro: {error}

source: Installation information file not found!
es: No se encontró el archivo de información de instalación

source: Search path:
es: Buscado en:

source: Uninstall {name}
es: Desinstalar {name}

source: App Info
es: Información de la aplicación

source: <b>Version:</b> {version}<br>
es: <b>Versión:</b> {version}<br>

source: <b>Installed:</b> {install_date}<br>
es: <b>Instalado:</b> {install_date}<br>

source: <b>Location:</b> {install_dir}
es: <b>Ubicación:</b> {install_dir}

source: This action cannot be undone
es: Esta acción no se puede deshacer

source: Additional files detected ({count_files})
es: Archivos adicionales detectados ({count_files})

source: These files were not part of the original installation (settings, saved data, etc):
es: Estos archivos no estaban en la instalación original (configuración, datos guardados, etc):

source: ... and {count_additional_files} more files
es: ... y {count_additional_files} archivos más

source: Delete additional files too
es: Eliminar también archivos adicionales

source: Uninstall
es: Desinstalar

source: Cancel
es: Cancelar

source: Confirm
es: Confirmar

source: Confirm uninstall of {name}?
es: ¿Confirmar desinstalación de {name}?

source: Could not delete {item_error}: {error}
es: No se pudo eliminar {item_error}: {error}

source: Could not delete {full_path_error}: {error}
es: No se pudo eliminar {full_path_error}: {error}

source: {name} uninstalled successfully
es: {name} desinstalado correctamente

source: {total_files_deleted} files deleted
es: {total_files_deleted} archivos eliminados

source: The uninstaller and remaining files will be deleted automatically when closing this window.
es: El desinstalador y archivos restantes se eliminarán automáticamente al cerrar esta ventana.

source: Uninstall Complete
es: Desinstalación completada

source: Error during uninstallation:
es: Error durante la desinstalación:

source: About
es: Acerca

source: Version {version}
es: Versión {version}

source: Developed by
es: Desarrollado por

source: Installs and uninstalls applications and utilities that do not provide an internal installation program
es: Instalador portable de aplicaciones desde archivos ZIP

source: Licenses and Components
es: Licencias y componentes

source: License
es: Licencia

source: View GPLv3 license
es: Ver licencia GPLv3

source: Components used
es: Componentes utilizados:

source: About GPLv3
es: Sobre GPLv3:

source: This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.
es: Este programa es software libre: puede redistribuirlo y/o modificarlo bajo los términos de la Licencia Pública General GNU publicada por la Free Software Foundation, ya sea la versión 3 de la Licencia, o (a su elección) cualquier versión posterior.

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
es: Este programa se distribuye con la esperanza de que sea útil, pero SIN NINGUNA GARANTÍA; sin siquiera la garantía implícita de COMERCIABILIDAD o IDONEIDAD PARA UN PROPÓSITO PARTICULAR. Consulte la Licencia Pública General GNU para obtener más detalles.

source: GUI framework
es: Framework de interfaz gráfica

source: Windows extensions for Python
es: Extensiones de Windows para Python

source: Windows PE file parser
es: Análisis de archivos PE (ejecutables de Windows)

source: Cross-platform desktop shortcut creation
es: Creación de accesos directos multiplataforma

source: Internationalization library
es: Librería para internacionalización

source: Python compiler
es: Compilador de Python

source: Close
es: Cerrar

source: Portable application installer from ZIP files
es: Instalador portable de aplicaciones desde archivos ZIP

source: Update {app} (v{vOld} → v{vNew})
es: Actualizar {app} (v{vOld} → v{vNew})

source: Uninstall {app_name}...
es: Desinstalar {app_name}...

source: Install {app_name} in the system
es: Instalar {app_name} en el sistema

source: About...
es: Acerca de...

source: Not available
es: No disponible

source: Self install is only available in the compiled version.
es: La instalación propia solo está disponible en la versión compilada.

source: Install {app_name}
es: Instalar {app_name}

source: Do you want to install {app_name} on your system?
es: ¿Desea instalar {app_name} en su sistema?

source: This will allow running it from the Start Menu.
es: Esto permitirá ejecutarlo desde el Menú Inicio.

source: Installation completed
es: Instalación finalizada

source: {app_name} installed successfully
es: {app_name} instalada correctamente

source: You can now run it from the Start Menu.
es: Ahora puede ejecutarlo desde el Menú Inicio.

source: Error during installation:
es: Error durante la instalación:

source: Uninstall {app_name}
es: Desinstalar {app_name}

source: Do you want to uninstall {app_name} from this system?
es: ¿Desea desinstalar {app_name} del sistema?

source: Uninstall completed
es: Desinstalación finalizada

source: {app_name} uninstalled successfully
es: {app_name} desinstalado correctamente

source: Install New Application
es: Instalar nueva aplicación

source: Select ZIP file
es: Seleccionar archivo ZIP

source: Select a ZIP file...
es: Seleciconar un archivo ZIP...

source: Browse
es: Examinar

source: Configuration
es: Configuración

source: Name:
es: Nombre:

source: Application name
es: Nombre de la aplicación

source: Version:
es: Versión:

source: Will be auto-detected
es: Se detectará automáticamente

source: Install in:
es: Instalar en:

source: Executable:
es: Ejecutable:

source: Create Desktop shortcut
es: Crear acceso directo en el escritorio

source: Create Start Menu shortcut
es: Crear acceso directo en el menú inicio

source: INSTALL
es: INSTALAR

source: ZIP Files (*.zip)
es: Archivos ZIP (*.zip)

source: Found: {first_exe}
es: Encontrado: {first_exe}

source: (in {root_dir}/)
es: (en {root_dir}/)

source: Error reading metadata: {error}
es: Error leyendo metadatos: {error}

source: Found: {first_exe} (no metadata)
es: Encontrado: {first_exe} (sin metadatos)

source: No executables found in ZIP's root folder
es: No se encontraron ejecutables en la raíz del ZIP

source: Select installation directory
es: Seleccionar carpeta de instalación

source: {display_name} installed sucessfully
es: {display_name} instalado correctamente

source: Location: {message}
es: Ubicación: {message}

source: The app will show in:
es: La aplicación aparecerá en:

source: Windows Configuration → Apps
es: Configuración de Windows → Aplicaciones

source: Control Panel → Programs
es: Panel de Control → Programas

source: To uninstall:
es: Para desinstalar:

source: From Windows Configuration, or
es: Desde Configuración de Windows, o

source: Running uninstall.exe from installation folder
es: Ejecutando uninstall.exe en la carpeta de instalación

source: Installation Finished
es: Instalación finalizada
